---
type: ConduitSizeSettingIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 8
tags: [revit-api, class]
---

# ConduitSizeSettingIterator

`Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | HasCurrent | 2017 | `public bool HasCurrent ()` |
| Method | IsDone | 2017 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2017 | `public virtual bool MoveNext ()` |
| Method | Reset | 2017 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual KeyValuePair < string , ConduitSizes > Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |